Documents/Списание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>Списание</Name>
			<BasedOn>
				<xr:Item>Document.Производство</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Остатки</xr:Item>
				<xr:Item>InformationRegister.СведенияОИсследованиях</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектПроизводства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтбиравшийПробу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричиныОтбораПроб</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтбора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТНПА</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТНПА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаслоТехническое</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстДляСлужебной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияТранспортировки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТранспортировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияОбИдентификации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформацияОбИдентификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыпускПродукции</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Производство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходНаИспытания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Потери</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвращеноВТЦ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМасла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладВозвратаМасла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пробы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПроб</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзготовления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРозлива</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВеличинаПартии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПартии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесПробы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦельИсследования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦелиИсследований</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТНПАНаОтборПроб</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТНПА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТНПА1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТНПА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Списание/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Процедура АктОтбораПроб1(ТабДок, Ссылка) Экспорт
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Макет = Документы.Списание.ПолучитьМакет("АктОтбораПроб1");
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Списание.Дата КАК Дата,
		|	Списание.Номер КАК Номер,
		|	Списание.ОбъектПроизводства КАК ОбъектПроизводства,
		|	Списание.ОтбиравшийПробу КАК ОтбиравшийПробу,
		|	Списание.Представитель КАК Представитель,
		|	Списание.ПричиныОтбораПроб КАК ПричиныОтбораПроб,
		|	Списание.ТНПА КАК ТНПА,
		|	Списание.Пробы.(
		|		НомерСтроки КАК НомерСтроки,
		|		НаименованиеПроб КАК НаименованиеПроб,
		|		ДатаИзготовления КАК ДатаИзготовления,
		|		ВЫБОР
		|			КОГДА Списание.Пробы.ДатаРозлива = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА """"
		|			ИНАЧЕ Списание.Пробы.ДатаРозлива
		|		КОНЕЦ КАК ДатаРозлива,
		|		ВеличинаПартии КАК ВеличинаПартии,
		|		НомерПартии КАК НомерПартии,
		|		ВесПробы КАК ВесПробы,
		|		ЦельИсследования КАК ЦельИсследования,
		|		НаименованиеПроб.ЕдиницыИзмерения.Наименование КАК НаименованиеПробЕдиницыИзмеренияНаименование
		|	) КАК Пробы,
		|	Списание.МаслоТехническое КАК МаслоТехническое,
		|	Списание.ОтбиравшийПробу.ФамилияИнициалы КАК ОтбиравшийПробуФамилияИнициалы,
		|	Списание.Представитель.ФамилияИнициалы КАК ПредставительФамилияИнициалы,
		|	Списание.РасходНаИспытания КАК РасходНаИспытания,
		|	Списание.Потери КАК Потери,
		|	Списание.ВозвращеноВТЦ КАК ВозвращеноВТЦ
		|ИЗ
		|	Документ.Списание КАК Списание
		|ГДЕ
		|	Списание.Ссылка В(&Ссылка)";
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьПробыШапка = Макет.ПолучитьОбласть("ПробыШапка");
		ОбластьПробы = Макет.ПолучитьОбласть("Пробы");
		ОбластьДвижениеМасла = Макет.ПолучитьОбласть("Расход");
		Подвал = Макет.ПолучитьОбласть("Подвал");
		ОбластьМаслоТехническое = Макет.ПолучитьОбласть("МаслоТехническое");
		
		ТабДок.Очистить();
		
		ВставлятьРазделительСтраниц = Ложь;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьЗаголовок);
			
			Шапка.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			
			ТабДок.Вывести(ОбластьПробыШапка);
			ВыборкаПробы = Выборка.Пробы.Выбрать();
			Пока ВыборкаПробы.Следующий() Цикл
				ОбластьПробы.Параметры.Заполнить(ВыборкаПробы);
				ОбластьПробы.Параметры.ДатаИзготовления = Формат(ВыборкаПробы.ДатаИзготовления, "ДЛФ=ДД");
				ОбластьПробы.Параметры.ДатаРозлива = Формат(ВыборкаПробы.ДатаРозлива, "ДЛФ=ДД");
				
				ТабДок.Вывести(ОбластьПробы, ВыборкаПробы.Уровень());
				ПоследнийНомерСтроки = ВыборкаПробы.НомерСтроки;
			КонецЦикла;
			Если Выборка.РасходНаИспытания > 0 или Выборка.Потери > 0 или Выборка.ВозвращеноВТЦ > 0 Тогда
				ОбластьДвижениеМасла.Параметры.НомерСтроки = ПоследнийНомерСтроки + 1;
				ОбластьДвижениеМасла.Параметры.ВидДвиженияМасла = "Расход на испытания";
				ОбластьДвижениеМасла.Параметры.КоличествоДвижения = Выборка.РасходНаИспытания;
				ТабДок.Вывести(ОбластьДвижениеМасла);

				ОбластьДвижениеМасла.Параметры.НомерСтроки = ПоследнийНомерСтроки + 2;
				ОбластьДвижениеМасла.Параметры.ВидДвиженияМасла = "Потери";
				ОбластьДвижениеМасла.Параметры.КоличествоДвижения = Выборка.Потери;
				ТабДок.Вывести(ОбластьДвижениеМасла);
				
				ОбластьДвижениеМасла.Параметры.НомерСтроки = ПоследнийНомерСтроки + 3;
				ОбластьДвижениеМасла.Параметры.ВидДвиженияМасла = "Возвращение в технологический цикл";
				ОбластьДвижениеМасла.Параметры.КоличествоДвижения = Выборка.ВозвращеноВТЦ;
				ТабДок.Вывести(ОбластьДвижениеМасла);
				
			КонецЕсли;
				
			Если Выборка.МаслоТехническое > 0 Тогда
				ОбластьМаслоТехническое.Параметры.Заполнить(Выборка);
				ТабДок.Вывести(ОбластьМаслоТехническое);
			КонецЕсли; 
			
			Подвал.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Подвал);
			
			ВставлятьРазделительСтраниц = Истина;
		КонецЦикла;
	#Иначе
		ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	#КонецЕсли	
КонецПроцедуры

Процедура АктОтбораПроб2(ТабДок, Ссылка) Экспорт
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Макет = Документы.Списание.ПолучитьМакет("АктОтбораПроб2");
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Списание.Дата,
		|	Списание.Номер,
		|	Списание.ОбъектПроизводства,
		|	Списание.ОтбиравшийПробу,
		|	Списание.Представитель,
		|	Списание.ПричиныОтбораПроб,
		|	Списание.ТНПА,
		|	Списание.Пробы.(
		|		НомерСтроки,
		|		НаименованиеПроб,
		|		ЕдиницыИзмерения,
		|		НомерПартии,
		|		ВеличинаПартии,
		|		ДатаИзготовления,
		|		ВесПробы
		|	)
		|ИЗ
		|	Документ.Списание КАК Списание
		|ГДЕ
		|	Списание.Ссылка В (&Ссылка)";
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьПробыШапка = Макет.ПолучитьОбласть("ПробыШапка");
		ОбластьПробы = Макет.ПолучитьОбласть("Пробы");
		Подвал = Макет.ПолучитьОбласть("Подвал");
		
		ТабДок.Очистить();
		
		ВставлятьРазделительСтраниц = Ложь;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьЗаголовок);
			
			Шапка.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			
			ТабДок.Вывести(ОбластьПробыШапка);
			ВыборкаПробы = Выборка.Пробы.Выбрать();
			Пока ВыборкаПробы.Следующий() Цикл
				ОбластьПробы.Параметры.Заполнить(ВыборкаПробы);
				ТабДок.Вывести(ОбластьПробы, ВыборкаПробы.Уровень());
			КонецЦикла;
			
			Подвал.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Подвал);
			
			ВставлятьРазделительСтраниц = Истина;
		КонецЦикла;
	#Иначе
		ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	#КонецЕсли	
КонецПроцедуры

Процедура АктОтбораПроб3(ТабДок, Ссылка) Экспорт
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Макет = Документы.Списание.ПолучитьМакет("АктОтбораПроб3");
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Списание.Дата КАК Дата,
		|	Списание.Номер КАК Номер,
		|	Списание.ОбъектПроизводства КАК ОбъектПроизводства,
		|	Списание.ОтбиравшийПробу КАК ОтбиравшийПробу,
		|	Списание.Представитель КАК Представитель,
		|	Списание.ПричиныОтбораПроб КАК ПричиныОтбораПроб,
		|	Списание.Пробы.(
		|		НомерСтроки КАК НомерСтроки,
		|		НаименованиеПроб КАК НаименованиеПроб,
		|		ДатаИзготовления КАК ДатаИзготовления,
		|		ВеличинаПартии КАК ВеличинаПартии,
		|		ВесПробы КАК ВесПробы,
		|		ЦельИсследования КАК ЦельИсследования,
		|		ТНПА1 КАК ТНПА1,
		|		ТНПАНаОтборПроб КАК ТНПА2,
		|		НомерПартии КАК НомерПартии,
		|		НаименованиеПроб.МассаНетто КАК НаименованиеПробМассаНетто
		|	) КАК Пробы,
		|	Списание.ОбъектПроизводства.Адрес КАК ОбъектПроизводстваАдрес,
		|	Списание.УсловияТранспортировки КАК УсловияТранспортировки,
		|	Списание.ИнформацияОбИдентификации КАК ИнформацияОбИдентификации
		|ИЗ
		|	Документ.Списание КАК Списание
		|ГДЕ
		|	Списание.Ссылка В(&Ссылка)";
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьПробыШапка = Макет.ПолучитьОбласть("ПробыШапка");
		ОбластьПробы = Макет.ПолучитьОбласть("Пробы");
		Подвал = Макет.ПолучитьОбласть("Подвал");
		
		ТабДок.Очистить();
		
		ВставлятьРазделительСтраниц = Ложь;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьЗаголовок);
			
			Шапка.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			
			ТабДок.Вывести(ОбластьПробыШапка);
			ВыборкаПробы = Выборка.Пробы.Выбрать();
			Пока ВыборкаПробы.Следующий() Цикл
				ОбластьПробы.Параметры.Заполнить(ВыборкаПробы);
				ОбластьПробы.Параметры.НаименованиеОрганизации = ОбщегоНазначенияСервер.ПолучитьНаименованиеОрганизации();
				ТабДок.Вывести(ОбластьПробы, ВыборкаПробы.Уровень());
			КонецЦикла;
			
			Подвал.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Подвал);
			
			ВставлятьРазделительСтраниц = Истина;
		КонецЦикла;
	#Иначе
		ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	#КонецЕсли	
КонецПроцедуры

Процедура СлужебнаяЗаписка(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(СлужебнаяЗаписка)
	Макет = Документы.Списание.ПолучитьМакет("СлужебнаяЗаписка");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Списание.Автор КАК Автор,
	|	Списание.Дата КАК Дата,
	|	Списание.Пробы.(
	|		НомерСтроки КАК НомерСтроки,
	|		НаименованиеПроб КАК НаименованиеПроб,
	|		ЕдиницыИзмерения КАК ЕдиницыИзмерения,
	|		ВесПробы КАК ВесПробы
	|	) КАК Пробы,
	|	НаименованиеОрганизации.Значение КАК ЗначениеНаименованияОрганизации,
	|	Списание.ОбъектПроизводства.Наименование КАК ОбъектПроизводстваНаименование,
	|	Руководитель.Значение.ФамилияИнициалыДательный КАК ЗначениеФамилияИнициалыДательный,
	|	Списание.ТекстДляСлужебной КАК ТекстДляСлужебной,
	|	Списание.Автор.Должность.Наименование КАК АвторДолжностьНаименование,
	|	Списание.Автор.ФамилияИнициалы КАК АвторФамилияИнициалы
	|ИЗ
	|	Документ.Списание КАК Списание,
	|	Константа.Руководитель КАК Руководитель,
	|	Константа.НаименованиеОрганизации КАК НаименованиеОрганизации
	|ГДЕ
	|	Списание.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПробыШапка = Макет.ПолучитьОбласть("ПробыШапка");
	ОбластьПробы = Макет.ПолучитьОбласть("Пробы");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПробыШапка);
		ВыборкаПробы = Выборка.Пробы.Выбрать();
		Пока ВыборкаПробы.Следующий() Цикл
			ОбластьПробы.Параметры.Заполнить(ВыборкаПробы);
			ТабДок.Вывести(ОбластьПробы, ВыборкаПробы.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

#КонецОбласти
